Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 10)                60        
_________________________________________________________________
dense_1 (Dense)              (None, 15)                165       
_________________________________________________________________
dense_2 (Dense)              (None, 25)                400       
_________________________________________________________________
dense_3 (Dense)              (None, 125)               3250      
_________________________________________________________________
dense_4 (Dense)              (None, 625)               78750     
_________________________________________________________________
dense_5 (Dense)              (None, 125)               78250     
_________________________________________________________________
dense_6 (Dense)              (None, 25)                3150      
_________________________________________________________________
dense_7 (Dense)              (None, 15)                390       
_________________________________________________________________
dense_8 (Dense)              (None, 10)                160       
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 11        
=================================================================
Total params: 164,586
Trainable params: 164,586
Non-trainable params: 0
_________________________________________________________________
